Revit 2027 API
BuiltInFailures.RebarFailures.RebarNoMatchingHooks Property
 The Rebar Shape '[Family Name]' has no matching hooks.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarNoMatchingHooks { get; }
Public Shared ReadOnly Property RebarNoMatchingHooks As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarNoMatchingHooks {
	FailureDefinitionId^ get ();
}
static member RebarNoMatchingHooks : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace